[
    {
        "meme": "Three people on a city sidewalk - a man in a blue checkered shirt and jeans walking with a blonde woman in a blue dress, while he turns his head and body to check out a brunette woman in a red dress walking past them. The girlfriend looks shocked and offended at her boyfriend's behavior. Urban street setting with buildings in background.",
        "usage_context": "Showing distraction, temptation, or preference for something new over what you currently have"
    },
    {
        "meme": "Four-panel vertical meme showing brains increasing in size and glow. First panel: small normal brain. Second panel: larger brain with slight glow. Third panel: larger brain with bright glow. Fourth panel: massive brain with intense bright glow/cosmic energy radiating from it.",
        "usage_context": "Depicting intellectual progression or increasingly sophisticated/absurd levels of thinking"
    },
    {
        "meme": "Recording studio scene with rapper standing in foreground wearing blue denim jacket, clear glasses, and multiple gold chains/jewelry, with dreadlocks. Second rapper seated behind him in black hoodie. Studio equipment, mixing boards, and other people visible in background. Both focused on something off-camera (computer screen). Professional studio lighting.",
        "usage_context": "Expressing intense concentration or focus on something mysterious or important"
    },
    {
        "meme": "Attractive woman (usually blonde) with a sad, frustrated, or tearful expression looking directly at camera. Clean, well-lit background suggesting comfortable, privileged environment. Professional photo quality.",
        "usage_context": "Expressing minor problems that only privileged people from wealthy countries would complain about"
    },
    {
        "meme": "Steven Crowder, a man with dark hair and beard, sitting at a small folding table outdoors. He's wearing casual clothing and has a handmade sign on the table that reads '[STATEMENT]: Change my mind.' Coffee mug visible on table. College campus or public setting in background.",
        "usage_context": "Presenting controversial or provocative statements while challenging others to argue against them"
    },
    {
        "meme": "Anime-style character (android from Japanese show) in business suit pointing with extended finger at a yellow and black butterfly. Character has spiky hair and confused expression. Speech bubble asks 'Is this a pigeon?' Outdoor setting with blue sky background.",
        "usage_context": "Expressing confusion, misidentification, or modern paranoia about situations"
    },
    {
        "meme": "Google search interface with search bar containing celebrity's stage name, with autocomplete or result showing ridiculous fake 'real name' like 'Lilliam Pumpanikel' for Lil Pump. Standard Google layout with white background and blue links.",
        "usage_context": "Creating humorous fake backstories or revealing supposed 'real names' of famous people"
    },
    {
        "meme": "Philip J. Fry from Futurama with orange hair, red jacket, and blue jeans, showing narrowed suspicious eyes and slight frown. Arms typically crossed or at sides. Orange/yellow background typical of Futurama animation style.",
        "usage_context": "Expressing uncertainty, suspicion, or contemplating contradictory questions"
    },
    {
        "meme": "Philip J. Fry from Futurama holding green money bills in both hands above his head, mouth wide open shouting enthusiastically. Same orange hair, red jacket character design. Animated Futurama art style.",
        "usage_context": "Expressing enthusiasm about wanting to purchase something immediately"
    },
    {
        "meme": "Text-only meme using the phrase 'weird flex but OK' in various fonts and formats.",
        "usage_context": "Responding to someone bragging about something awkward, irrelevant, or strange"
    },
    {
        "meme": "Anthropomorphic dog character wearing small black hat, sitting calmly at table holding white coffee mug. Orange flames and smoke fill the entire background/room. Dog has slight smile and relaxed posture despite the chaos. Comic art style with bright orange fire colors.",
        "usage_context": "Dealing with troubling or chaotic situations while pretending everything is normal"
    },
    {
        "meme": "Bernie Sanders, elderly man with white hair and glasses, wearing brown/tan hooded winter coat (hood up), standing outdoors in winter setting with bare trees in background. Text overlay reads 'I am once again asking for your financial support.' Serious, determined expression looking directly at camera.",
        "usage_context": "Repeatedly asking for money, support, or help with something, often in a persistent manner"
    },
    {
        "meme": "Kermit the Frog puppet with bright green skin, sitting with white coffee/tea mug held in both green hands near his mouth. Characteristic large bulging eyes with small black pupils. Slight knowing expression or side-eye glance.",
        "usage_context": "Making passive-aggressive comments while pretending to stay out of drama"
    },
    {
        "meme": "Two Kermit puppets - regular bright green Kermit on left, and darker hooded Kermit on right wearing black hood like Palpatine. Dark Kermit appears to be whispering to regular Kermit. Often shows internal moral conflict.",
        "usage_context": "Internal debate between good and evil thoughts or moral vs immoral impulses"
    },
    {
        "meme": "Various photographs of domestic cats in humorous situations - can include cats with funny expressions, cats in unusual positions, cats with caption text, or cats appearing to react to situations. Wide variety of breeds, colors, and settings.",
        "usage_context": "General humor, expressing relatable emotions, or internet culture references"
    },
    {
        "meme": "Black woman in pink blazer and black pants with high heels, crouched down in squatting position while laughing heartily. She's in an outdoor parking lot or public area with cars and pavement visible in background. Joyful, animated expression.",
        "usage_context": "Finding something unbelievable, suspicious, or hard to comprehend"
    },
    {
        "meme": "Woman giving exaggerated wink - likely actress Kathryn Hahn as Agatha from WandaVision. Detailed appearance would depend on specific scene context from the show including costume and setting.",
        "usage_context": "Expressing sarcasm, obvious deception, or being knowingly secretive about something"
    },
    {
        "meme": "Patrick Star from SpongeBob SquarePants with an evil, menacing facial expression. Pink starfish character with angry eyebrows, glowing red or intensely dark eyes, and sinister smile or scowl. Darker lighting than typical SpongeBob animation.",
        "usage_context": "Expressing malicious intent, bad behavior, or villainous thoughts"
    },
    {
        "meme": "Text-based format using the template 'By age 35 you should have...' followed by various humorous or unrealistic expectations.",
        "usage_context": "Mocking unrealistic life expectations or societal pressure about achievements by certain ages"
    },
    {
        "meme": "Illustration showing two people sitting on opposite sides of a bus interior. Left person looking sad at brick wall view, right person smiling at sunny window view. Art style and character appearances would depend on the original Brazilian illustration.",
        "usage_context": "Showing how two people can have completely different perspectives on the same situation"
    },
    {
        "meme": "Two muscular, sweaty men (Arnold Schwarzenegger and Carl Weathers from Predator) gripping each other's hands in an elaborate, powerful handshake. Both men straining with intense facial expressions. Jungle/military setting background.",
        "usage_context": "Representing agreements, alliances, or mutual understanding between two parties"
    },
    {
        "meme": "Elon Musk sitting at podcast table wearing black shirt and large headphones, smoking what appears to be marijuana with visible smoke rising. Relaxed posture, slight smirk, looking off to the side. Professional podcast studio setting with curtains in background.",
        "usage_context": "Tech humor, entrepreneur jokes, or references to controversial behavior"
    },
    {
        "meme": "SpongeBob SquarePants character in mocking pose with bent arms creating chicken-wing like position, hunched over with distorted face making exaggerated expression. Yellow sponge character with large eyes and buck teeth emphasized.",
        "usage_context": "Making fun of someone's opinion by mimicking it in an exaggerated, childish way"
    },
    {
        "meme": "Black man in dark jacket pointing his index finger to his temple/forehead in 'thinking' gesture. Slight smile on face, confident expression. Urban street setting in background. Classic 'tapping temple' pose suggesting he has a clever idea.",
        "usage_context": "Presenting obviously flawed logic or terrible ideas as if they were clever solutions"
    },
    {
        "meme": "Text-based format using Ariana Grande's song lyrics format listing three items that taught 'love,' 'patience,' and 'pain' respectively, ending with 'thank u, next.'",
        "usage_context": "Moving on from something and listing what different experiences taught you"
    },
    {
        "meme": "Text-based meme using the phrase 'Let's get this bread' in various fonts and contexts.",
        "usage_context": "Ironically motivating people to work or make money, often used sarcastically"
    },
    {
        "meme": "Pikachu (yellow electric mouse Pokémon) with extremely wide, shocked eyes and open mouth showing complete surprise. Large black eyes with white highlights, red cheek circles, and pointed ears. Typical Pokémon anime art style.",
        "usage_context": "Reacting with fake surprise to completely predictable or obvious outcomes"
    },
    {
        "meme": "Gene Wilder as Willy Wonka wearing purple velvet jacket and bow tie, with curly hair and condescending smile. One eyebrow slightly raised, knowing smirk on face. Rich, colorful background typical of the 1971 film.",
        "usage_context": "Delivering patronizing comments or mocking someone in a sophisticated way"
    },
    {
        "meme": "Red carpet event scene with Henry Cavill in foreground wearing formal dark gray suit and patterned tie, looking serious/professional toward camera. Jason Momoa behind him with long dark hair, appearing to sneak up or photobomb with mischievous expression. Movie premiere setting with crowds and lighting visible in background.",
        "usage_context": "Something approaching or replacing something else, often representing time periods or changes"
    },
    {
        "meme": "SpongeBob SquarePants character leaning against a rock or surface, appearing completely exhausted and naked/without his usual shirt. Detailed pose and background would depend on the specific episode scene.",
        "usage_context": "Expressing extreme tiredness, burnout, or being overwhelmed by life"
    },
    {
        "meme": "Classical Renaissance, medieval, or baroque paintings (oil paintings with religious or mythological themes) overlaid with modern, humorous text captions. Wide variety of historical artworks possible.",
        "usage_context": "Applying contemporary humor and relatable situations to historical art"
    },
    {
        "meme": "Elderly gentleman with gray beard wearing sophisticated clothing (often a suit), sitting in an ornate chair or refined setting. Distinguished appearance with thoughtful expression. Often associated with Dos Equis beer advertising aesthetic.",
        "usage_context": "Using the format 'I don't always X, but when I do, I Y' to describe preferences"
    },
    {
        "meme": "Close-up of man's face shown in side-by-side comparison showing rapid blinking motion. Light-skinned man with short hair, appearing confused and nervous. Often shown as animated GIF capturing the blinking sequence. Clean background, professional lighting.",
        "usage_context": "Expressing confusion, being caught off guard, or not knowing how to respond"
    },
    {
        "meme": "Two-panel meme format. Top panel: hands holding white pill bottle with label reading 'Hard to swallow pills' against soft gradient background. Bottom panel: open palm holding two small white round pills. Clean, medical/pharmaceutical aesthetic with soft lighting.",
        "usage_context": "Presenting difficult truths or uncomfortable facts that people don't want to accept"
    },
    {
        "meme": "Two subjects positioned as opponents facing each other, often with 'VS' or 'Who would win?' text between them. Can be any variety of images, characters, or concepts being compared.",
        "usage_context": "Setting up hypothetical battles or comparisons between two different things"
    },
    {
        "meme": "References to the Marvel character Morbius or the poorly received 2022 film. May include movie posters, stills from the film, or text-based references.",
        "usage_context": "Ironic enthusiasm or fake support for something that is actually terrible"
    },
    {
        "meme": "Screenshots from reality TV show 'Keeping Up with the Kardashians' showing various family members (Kim, Kourtney, Khloe, etc.) with exaggerated emotional reactions - crying, yelling, shocked expressions, dramatic gestures.",
        "usage_context": "Expressing over-the-top emotional reactions or melodramatic responses to minor issues"
    },
    {
        "meme": "Black man sitting at wooden table holding large fan of UNO cards in both hands, showing many cards accumulated. On left side, close-up of UNO card showing 'draw 25' with the classic UNO logo and color wheel. Table setting suggests he chose to draw cards rather than complete a difficult task.",
        "usage_context": "Choosing to accept a penalty rather than do something you really don't want to do"
    },
    {
        "meme": "Pepe the Frog - green anthropomorphic frog character with large eyes and wide mouth. Originally showed peaceful, content expression ('feels good man') but later variations include sad Pepe (droopy eyes, frown) and angry Pepe (furrowed brow, scowl). Simple cartoon art style.",
        "usage_context": "Originally expressing positive emotions, later became associated with internet culture and controversy"
    },
    {
        "meme": "Michael Jordan in formal suit at podium, visibly emotional with tears streaming down his face during his Basketball Hall of Fame induction speech. Professional lighting, formal event setting with microphones visible.",
        "usage_context": "Expressing disappointment when your team loses or performs poorly"
    },
    {
        "meme": "Car salesman in business attire (shirt and tie) with one hand slapping/patting the roof of a car while pointing with the other hand. Usually shown from side angle demonstrating the car. Car dealership lot setting in background.",
        "usage_context": "Using the format 'This bad boy can fit so much X in it' to highlight capacity or features"
    },
    {
        "meme": "Young blonde girl (toddler, around 2-3 years old) sitting in car seat wearing purple/pink shirt. Perfect side-eye expression with skeptical, unimpressed look directed at camera. Classic 'judging' facial expression that appears both innocent and sassy. Car interior visible in background.",
        "usage_context": "Expressing skepticism, judgment, or awkwardness in any uncomfortable situation"
    },
    {
        "meme": "Two cartoon restaurants from SpongeBob SquarePants. Krusty Krab: red lobster-shaped building with wooden ship-like appearance. Chum Bucket: gray/silver metallic building with industrial look and 'CHUM BUCKET' sign. Often shown side by side for comparison.",
        "usage_context": "Comparing two rival options where one is clearly superior to the other"
    },
    {
        "meme": "Small elf doll with pointed hat, typically wearing red and green clothing, positioned sitting on a wooden shelf or mantle. Traditional Christmas decoration with classic elf appearance.",
        "usage_context": "Creating rhyming pairs using the format 'You've heard of elf on shelf, now get ready for X on Y'"
    },
    {
        "meme": "Sean Bean as Boromir from Lord of the Rings wearing medieval armor and cloak, with serious, stern expression. Long dark hair, weathered face, and authoritative demeanor. Fantasy/medieval setting background.",
        "usage_context": "Stating that something is not easily accomplished using 'One does not simply' format"
    },
    {
        "meme": "Dating app or personal ad template language using format like 'I am a [man/woman] looking for a [man/woman]' followed by humorous or absurd preferences.",
        "usage_context": "Making humorous declarations about preferences or desires in dating format"
    },
    {
        "meme": "Toddler boy (around 1-2 years old) on beach with sand, wearing only a diaper, with determined facial expression and one small fist clenched triumphantly raised in the air. Sunny beach setting with ocean in background.",
        "usage_context": "Celebrating small victories or minor successes in daily life"
    },
    {
        "meme": "Young woman with long brown hair, wide staring eyes with intense gaze, and unsettling smile that appears overly attached or obsessive. Close-up shot focusing on her facial expression. Plain background.",
        "usage_context": "Portraying clingy, overly attached, or possessive behavior in relationships"
    },
    {
        "meme": "White House lawn scene with Donald Trump in dark suit and signature red tie standing and appearing to shout or call out, while young boy in red shirt operates riding lawnmower nearby, completely focused on his task and ignoring Trump. Manicured White House grounds with steps and landscaping visible in background.",
        "usage_context": "Being ignored while trying to get someone's attention or having your authority dismissed"
    },
    {
        "meme": "Highway scene with green exit sign reading 'LEFT EXIT 12' mounted on overpass bridge structure. Blue car dramatically drifting/swerving from straight highway lane toward the left exit ramp. Road has white lane markings, guardrails visible, and typical highway infrastructure. Often shown as sequence capturing the sudden lane change.",
        "usage_context": "Suddenly changing course or abandoning your original plan for something more appealing"
    },
    {
        "meme": "Homer Simpson (yellow-skinned cartoon character with bald head and remaining hair on sides) slowly backing into green hedge bushes until he completely disappears. Classic Simpsons animation style with bright colors. Usually shown as animated GIF sequence.",
        "usage_context": "Awkwardly retreating from embarrassing situations or trying to escape unnoticed"
    },
    {
        "meme": "An AI chatbot confidently responds with bizarre statements like “purchase three partial illusions of broccoli,” clearly failing to make sense.",
        "usage_context": "Highlighting absurd or nonsensical outputs from AI text generators."
    },
    {
        "meme": "An AI-generated image with impossible anatomy—extra limbs, floating objects, or twisted proportions—exaggerating the quirks of machine vision.",
        "usage_context": "Poking fun at AI visual hallucinations and glitchy art creations."
    },
    {
        "meme": "A virtual assistant giving hilariously wrong advice, such as telling someone to ‘boil your socks’ to fix a phone issue.",
        "usage_context": "Commenting on technology misunderstanding simple human queries."
    },
    {
        "meme": "A surreal mashup where classic memes are oddly blended—like a distracted boyfriend holding a Bongo Cat instead.",
        "usage_context": "Showing how AI remixes familiar content into bizarre hybrids."
    },
    {
        "meme": "Someone wearing a large Vision Pro–style VR headset walking awkwardly into a wall in the real world.",
        "usage_context": "Mocking the awkward teething stage of emerging technologies."
    },
    {
        "meme": "A person mowing the lawn happily while a tornado is clearly advancing behind them.",
        "usage_context": "Pointing out when expectations badly diverge from reality."
    },
    {
        "meme": "A VR user mid-faceplant into a couch while swinging wildly in a virtual environment.",
        "usage_context": "Highlighting the comedic dangers of immersive virtual-reality play."
    },
    {
        "meme": "Someone confidently punching in VR but in real life they wildly miss hitting a wall.",
        "usage_context": "Showing the funny disconnect between virtual confidence and real-world awkwardness."
    },
    {
        "meme": "A VR player reacting with sheer terror as a spider suddenly appears in their field of view.",
        "usage_context": "Capturing the abrupt fright of VR jump-scares."
    },
    {
        "meme": "A dreamy scene of a fictional character with overlaid heartfelt text expressing deep, unrealistic crush feelings.",
        "usage_context": "Capturing delusional romantic fantasies about fictional characters."
    },
    {
        "meme": "A split image showing someone imagining a perfect crush scenario from Squid Game compared to an awkward real-life date.",
        "usage_context": "Contrasting romantic daydreams with disappointing reality."
    },
    {
        "meme": "Anakin Skywalker looking annoyed in the Clone Wars when he says, “I hate sand.”",
        "usage_context": "Expressing mild irritation or distaste for unpleasant things."
    },
    {
        "meme": "Palpatine in Clone Wars urging someone with “Do it.”",
        "usage_context": "Supporting or encouraging someone to take a bold or risky action."
    },
    {
        "meme": "Clone troopers Rex and Wolffe in a strong handshake, symbolizing tight camaraderie.",
        "usage_context": "Representing strong alliances or brotherly friendships."
    },
    {
        "meme": "Ahsoka dramatically pulling out her hidden lightsaber for a reveal moment.",
        "usage_context": "Indicating a sudden reveal of hidden power or skill."
    },
    {
        "meme": "Yoda saying, “Much to learn there is,” with a thoughtful expression.",
        "usage_context": "Acknowledging lack of knowledge or the need to study more."
    },
    {
        "meme": "A sad cat with tearful eyes staring forlornly into the distance.",
        "usage_context": "Expressing mild sadness or disappointment."
    },
    {
        "meme": "A wide‑eyed startled cat caught mid-jump.",
        "usage_context": "Reacting to shocking or unexpected news."
    },
    {
        "meme": "Bongo Cat slapping table bongo drums in sync with popular songs.",
        "usage_context": "Showing simple joy or rhythmic approval."
    },
    {
        "meme": "A Lolcat speaking in intentionally broken English like ‘I can haz cheeseburger?’",
        "usage_context": "Conveying humorous thoughts of a cat in quirky broken grammar."
    },
    {
        "meme": "A baby ferret bathing itself with an adorably overwhelmed expression.",
        "usage_context": "Highlighting cute reactions to routine or mundane tasks."
    },
    {
        "meme": "A very tiny puppy strutting around as if it owns the place.",
        "usage_context": "Illustrating fierce personality in a small, adorable package."
    },
    {
        "meme": "A raccoon caught mid-snack, looking mischievous and guilty.",
        "usage_context": "Representing playful or sneaky misbehavior."
    },
    {
        "meme": "A fox with stylish hair and sunglasses giving serious gangster energy.",
        "usage_context": "Creating contrast between cuteness and tough attitude."
    },
    {
        "meme": "A seal pup staring with huge, innocent eyes.",
        "usage_context": "Eliciting sympathy through overwhelming cuteness."
    },
    {
        "meme": "A fox with mouth agape in exaggerated surprise.",
        "usage_context": "Expressing astonishment or disbelief."
    },
    {
        "meme": "A cat wearing glasses and a bowtie looking scholarly.",
        "usage_context": "Portraying intelligence or pretending to be nerdy."
    },
    {
        "meme": "The monkey puppet looking sideways with awkward expression.",
        "usage_context": "Representing internal discomfort or awkward social moments."
    },
    {
        "meme": "A small cat delivering a big punch in a one‑punch GIF.",
        "usage_context": "Symbolizing a minor action with unexpectedly large impact."
    },
    {
        "meme": "Baby hippo ‘Moo Deng’ making adorable noises in water.",
        "usage_context": "Capturing irresistibly cute and quirky behavior."
    },
    {
        "meme": "A sibling pygmy hippo joining Moo Deng in clumsy antics.",
        "usage_context": "Displaying family support or shared cuteness."
    },
    {
        "meme": "An angry weasel confronting another animal aggressively.",
        "usage_context": "Depicting fierce energy in a small creature."
    },
    {
        "meme": "A large penguin slipping or waddling in a silly way.",
        "usage_context": "Highlighting goofy but charming behavior."
    },
    {
        "meme": "A beaver with an overly dramatic expression of flair.",
        "usage_context": "Expressing theatrical drama in a cute form."
    },
    {
        "meme": "A panda shaking or wobbling in nervous excitement.",
        "usage_context": "Showing anxious or jittery energy in a large, cuddly animal."
    },
    {
        "meme": "A seal making ‘biscuits’ by kneading with flippers on bedding.",
        "usage_context": "Depicting cozy, mess-making cuteness."
    },
    {
        "meme": "Country‑balls comics depicting nations arguing in broken English.",
        "usage_context": "Satirizing geopolitics with playful multilingual humor."
    },
    {
        "meme": "A person’s face replaced mid-scene with the Troll Face in a video.",
        "usage_context": "Highlighting dramatic trolling or mock taunts."
    },
    {
        "meme": "A brightly colored dolphin with cheerful visuals overlaid with dark text like “I’m depressed.”",
        "usage_context": "Symbolizing contrast between pretty appearance and sad feelings."
    },
    {
        "meme": "An anthropomorphic dog leaning back casually, wearing cool clothes.",
        "usage_context": "Projecting chill, laid‑back vibes or nonchalance."
    },
    {
        "meme": "An AI-generated animal hybrid with an absurd Italian name like ‘Chimpanzini Bananini’.",
        "usage_context": "Embracing surreal, absurd humor that makes strange sense."
    },
    {
        "meme": "A humanoid toilet head dancing across a surreal backdrop (Skibidi Toilet).",
        "usage_context": "Representing chaotic, viral absurdity trending online."
    },
    {
        "meme": "Stick‑figure AI brainrot meme chanting ‘Tung Tung Tung Sahur’.",
        "usage_context": "Capturing regional surreal internet trends with local flavor."
    },
    {
        "meme": "Cheems, a Shiba Inu with mumbled speech bubble, looking hesitant.",
        "usage_context": "Expressing shy or understated thoughts with cute dog humor."
    },
    {
        "meme": "Grumpy Cat glaring with a sarcastic caption overlay.",
        "usage_context": "Delivering grouchy humor or expressing mild disdain."
    },
    {
        "meme": "The ‘Replicate This Image 100 Times’ meme showing AI warping a familiar picture into uncanny distortions.",
        "usage_context": "Pointing out how AI degrades images through recursive imitation."
    },
    {
        "meme": "A video clip of AI‑generated Will Smith bizarrely eating spaghetti, looking uncanny.",
        "usage_context": "Demonstrating odd results of AI video generation and uncanny valley."
    }
]
    
